[
{
    "status": "ok",
    "totalResults": 70,
    "articles": [
      {
        "source": {
          "id": null,
          "name": "Dobreprogramy.pl"
        },
        "author": "Karolina Kowasz",
        "title": "Google ostrzega. 14 tysięcy użytkowników Gmaila jest zagrożonych - dobreprogramy",
        "description": "Google ostrzega swoich użytkowników przed atakami rosyjskich hakerów. W informacji rozesłanej do około 14 tysięcy użytk…",
        "url": "https://www.dobreprogramy.pl/google-ostrzega-14-tysiecy-uzytkownikow-gmaila-jest-zagrozonych,6691943077673632a",
        "urlToImage": "https://i.wpimg.pl/4200x2931/filerepo.grupawp.pl/api/v1/display/embed/8d95800f-09e6-46f3-861f-e81275c0596b",
        "publishedAt": "2021-10-09T10:45:00Z",
        "content": "Google ostrzega swoich uytkowników przed atakami rosyjskich hakerów. W informacji rozesanej do okoo 14 tysicy uytkowników poczty Gmail poinformowali o istniejcym zagroeniu ze strony grupy APT28, znan… [+1583 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Antyweb.pl"
        },
        "author": null,
        "title": "Nadchodzi nowy iPhone SE, który wygląda tak samo jak wcześniejsza odsłona - Antyweb",
        "description": "iPhone SE okazał się sprzedażowym hitem, choć mocno odstawał od nowych iPhonów. Cena, podzespoły, klasyczny wygląd - te rzeczy były kluczowe dla jego popularności. Ale ile można piłować to samo?",
        "url": "https://antyweb.pl/nadchodzi-nowy-iphone-se-ktory-wyglada-tak-samo-jak-wczesniejsza-odslona",
        "urlToImage": "https://antyweb.pl/img/1250/550/fit/wp-content/uploads/2020/05/12082249/iphone_se_2020_11.jpg",
        "publishedAt": "2021-10-09T10:03:48Z",
        "content": "Testowaem ostatniego iPhona SE i gdyby nie razia mnie archaiczna obudowa oraz kiepski czas pracy na jednym adowaniu, moliwe e zdecydowabym si na jego zakup.\r\nKluczowe dla tego modelu byy moim zdaniem… [+1936 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Komputerswiat.pl"
        },
        "author": "Dawid Długosz",
        "title": "WinRar dla Windows 11 dostaje aktualizację usuwającą uporczywy problem - Komputer Świat",
        "description": "WinRar to popularny program do obsługi archiwów, który w systemie Windows 11 sprawia pewne problemy. Te związane były są z menu kontekstowym nowych okienek, które Microsoft postanowił nieco zmodyfikować. Dotyczyło to także schowania pewnych elementów, co okaz…",
        "url": "https://www.komputerswiat.pl/aktualnosci/programy/winrar-dla-windows-11-dostaje-aktualizacje-usuwajaca-uporczywy-problem/lx94b19",
        "urlToImage": "https://ocdn.eu/pulscms-transforms/1/Hw2ktkpTURBXy9hMjA1YTJlOTExOTI0YjY1YjYxMWMxMzQ3OTVmMTk1Ny5qcGeSlQMAPs0H0M0EZZMFzQSwzQJ2",
        "publishedAt": "2021-10-09T09:04:00Z",
        "content": "Windows 11 jest ju dostpny i wprowadzi wiele zmian w designie okienek. Dotycz one take menu kontekstowego, które dostao zaokrglone naroniki. Pojawiy si te pewne modyfikacje zwizane z funkcjonalnoci i… [+620 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Komputerswiat.pl"
        },
        "author": "Bartłomiej Sieja",
        "title": "Tani GeForce RTX w Media Expert. Mamy zdjęcia z promocji, pod sklepem ustawiły się tłumy - Komputer Świat",
        "description": "Kojarzycie sceny, w których ludzie tłuką się między sobą o kawałek przecenionego karpia, torebkę albo lody Ekipy, prawda? W przypadku promocji na karty graficzne GeForce RTX z serii 30, którą zorganizował w jednym z oddziałów Media Expert, nie było wprawdzie …",
        "url": "https://www.komputerswiat.pl/aktualnosci/sprzet/tani-geforce-rtx-w-media-expert-mamy-zdjecia-z-promocji-pod-sklepem-ustawily-sie/6b61zgq",
        "urlToImage": "https://ocdn.eu/pulscms-transforms/1/lp1ktkpTURBXy81Yzk4NDlkZGM1ZTIyZWE4ZWIzMmY0ZTFiOWY0NTdkNC5wbmeSlQPMzwDNBX3NAxiTBc0EsM0Cdg",
        "publishedAt": "2021-10-09T08:06:26Z",
        "content": "Zanim pokaemy same zdjcia krótkie wyjanienie. Dramatyczna sytuacja na rynku kart graficznych sprawia, e w przypadku najnowszych i najmocniejszych modeli mamy do czynienia tylko z dwoma scenariuszami.… [+1797 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Dobreprogramy.pl"
        },
        "author": "Karolina Kowasz",
        "title": "Policja ostrzega. Słyszysz te słowa? Od razu się rozłącz - dobreprogramy",
        "description": "Coraz częściej spoofing jest wykorzystywany przez oszustów, którzy w ten sposób wyłudzają nasze dane by móc zyskać dost…",
        "url": "https://www.dobreprogramy.pl/policja-ostrzega-slyszysz-te-slowa-od-razu-sie-rozlacz,6691894844598912a",
        "urlToImage": "https://i.wpimg.pl/5760x3840/filerepo.grupawp.pl/api/v1/display/embed/62469316-0e17-47d9-9c4f-368c802b7629",
        "publishedAt": "2021-10-09T07:51:00Z",
        "content": "Coraz czciej spoofing jest wykorzystywany przez oszustów, którzy w ten sposób wyudzaj nasze dane by móc zyska dostp do naszych pienidzy. Zjawisko jest na tyle powane, e policja wydaa przez nim specja… [+3263 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Gsmmaniak.pl"
        },
        "author": "Monika Szefler",
        "title": "Nie mam wątpliwości: ta taniutka Motorola nie ma żadnych szans u Polaków. Mam rację? - gsmManiaK.pl",
        "description": "Październik przynosi nam kolejny debiut budżetowego smartfona Motoroli. Motorola Moto G Pure to nieźle wyceniony smartfon, ale niekoniecznie na naszym rynku. Czy jest szansa na Polską premierę?",
        "url": "https://www.gsmmaniak.pl/1261894/motorola-moto-g-pure-cena-premiera/",
        "urlToImage": "https://www.gsmmaniak.pl/wp-content/uploads/gsmmaniak/2020/08/Zrzut-ekranu-933.png",
        "publishedAt": "2021-10-09T06:30:23Z",
        "content": "Padziernik przynosi nam kolejny debiut budetowego smartfona Motoroli. Motorola Moto G Pure to niele wyceniony smartfon, ale niekoniecznie na naszym rynku. Czy jest szansa na Polsk premier? \r\nBudetowa… [+1783 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Www.ppe.pl"
        },
        "author": null,
        "title": "Oppo Reno6 Pro 5G - test smartfona. Duże, pozytywne zaskoczenie - Portal PPE.PL",
        "description": "Muszę przyznać, że nie obiecywałem sobie zbyt wiele po najnowszym modelu z rodziny Oppo Reno6. Nie byłem specjalnie zachwycony poprzednikiem. Całe szczęście, niektóre firmy potrafią jeszcze...",
        "url": "https://www.ppe.pl/publicystyka/11694/oppo-reno6-pro-5g-test-smartfona-duze-pozytywne-zaskoczenie.html",
        "urlToImage": "https://img.ppe.pl/upload/articles/98/53/29/1200/628/985329975.jpg",
        "publishedAt": "2021-10-08T20:35:30Z",
        "content": "Nie zapomn, jak testowaem pierwszy smartfon na amach PPE i by to model Oppo Reno3 Pro, który nie zrobi na mnie najlepszego wraenia. Potem do redakcji przyjeday kolejne wersje, na czele z do przecitny… [+17030 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Onet.pl"
        },
        "author": "Wiadomości Onet",
        "title": "Instagram nie działa. Rośnie też liczba zgłoszeń awarii Facebooka - Wiadomości - Onet",
        "description": "Instagram w piątek wieczorem potwierdził ponowne problemy aplikacji- zaledwie kilka dni po poważnej awarii. Taka sama sytuacja miała miejsce w przypadku Facebooka. Problemy pojawiły się również z Messengerem oraz komunikatorem WhatsApp.",
        "url": "https://wiadomosci.onet.pl/swiat/instagram-przestal-dzialac-liczne-zgloszenia-awarii-facebooka/4f5hr58",
        "urlToImage": "https://ocdn.eu/pulscms-transforms/1/_aCk9kpTURBXy80NDFhYzQ4OTliOGFkMjgwNTNlMWIyZjkwYzNiM2M2MS5qcGeTlQMAzIfNENvNCXuTCaZkYmNmODcGkwXNBLDNAnaBoTAB/kolejna-awaria-w-tym-tygodniu-instagram-nie-dziala.jpg",
        "publishedAt": "2021-10-08T19:26:00Z",
        "content": "<ul><li>W pitek wieczorem uytkownicy Instagramu zgaszali gównie problem z aplikacj (57 proc.), z kolei 21 proc. w ogóle nie mogo zalogowa si do swoich kont</li><li>Jak podaje DownDetector, w pitek w … [+2847 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Gsmmaniak.pl"
        },
        "author": "Konrad Bartnik",
        "title": "Atak klonów trwa w najlepsze. realme GT Neo 2T to przedziwny smartfon - gsmManiaK.pl",
        "description": "realme GT Neo 2T to kolejny mocny średniak w ofercie chińskiego producenta. Kusi mocnym procesorem, ale rodzi też pytanie - po co nam ten atak klonów? Poznaj specyfikację i design modelu, który na",
        "url": "https://www.gsmmaniak.pl/1262008/realme-gt-neo-2t-specyfikacja-wyglad-tenaa/",
        "urlToImage": "https://www.gsmmaniak.pl/wp-content/uploads/gsmmaniak/2021/10/Zrzut-ekranu-486.jpg",
        "publishedAt": "2021-10-08T19:00:37Z",
        "content": "realme GT Neo 2T to kolejny mocny redniak w ofercie chiskiego producenta. Kusi mocnym procesorem, ale rodzi te pytanie – po co nam ten atak klonów? Poznaj specyfikacj i design modelu, który na dniach… [+1892 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Telepolis.pl"
        },
        "author": "Mieszko",
        "title": "Dimensity 2000 będzie zbudowany jak Snapdragon 898 i podobnie do Exynosa 2200 - TELEPOLIS.PL",
        "description": "O układzie Dimensity 2000, który ma stanowić konkurencję dla wciąż niewydanego Snapdragona 898, mówi się już od paru ładnych miesięcy. Najnowsze doniesienia potwierdzają podstawowe dane techniczne tego chipsetu i dodają nowe szczegóły.",
        "url": "https://www.telepolis.pl/wiadomosci/sprzet/dimensity-2000-bedzie-zbudowany-jak-snapdragon-898-i-podobnie-do-exynosa-2200",
        "urlToImage": "https://www.telepolis.pl/images/2021/10/mediatek-dimensity-2000-4nm-ARMv9.jpg",
        "publishedAt": "2021-10-08T18:17:55Z",
        "content": "O ukadzie Dimensity 2000, który ma stanowi konkurencj dla wci niewydanego Snapdragona 898, mówi si ju od paru adnych miesicy. Najnowsze doniesienia potwierdzaj podstawowe dane techniczne tego chipset… [+2182 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Gsmmaniak.pl"
        },
        "author": "Konrad Bartnik",
        "title": "Oto Samsung Galaxy S22 Ultra pod każdym możliwym kątem. Fanie Note - jesteś w domu! - gsmManiaK.pl",
        "description": "Samsung Galaxy S22 Ultra pozuje najlepszych do tej pory renderach. Przyjrzyj się flagowcowi pod każdym możliwym kątem i zobacz S Pen chowany w obudowie. Fani Galaxy Note nareszcie dostaną to, na co",
        "url": "https://www.gsmmaniak.pl/1261977/samsung-galaxy-s22-ultra-nowe-rendery-s-pen/",
        "urlToImage": "https://www.gsmmaniak.pl/wp-content/uploads/gsmmaniak/2021/10/Screenshot-2021-10-08-13.28.42.jpg",
        "publishedAt": "2021-10-08T18:15:48Z",
        "content": "Samsung Galaxy S22 Ultra pozuje najlepszych do tej pory renderach. Przyjrzyj si flagowcowi pod kadym moliwym ktem i zobacz S Pen chowany w obudowie. Fani Galaxy Note nareszcie dostan to, na co czekal… [+1856 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Komorkomania.pl"
        },
        "author": null,
        "title": "iPhone 13 Pro Max: test. Godny konkurent dla flagowców z Androidem - Komórkomania",
        "description": "iPhone 13 Pro Max to jeden z najbardziej wyczekiwanych smartfonów ostatnich miesięcy. Czy warto go kupić? Sprawdźmy.",
        "url": "https://komorkomania.pl/40213,iphone-13-pro-max-test-wreszcie-godny-konkurent-dla-flagowcow-z-androidem",
        "urlToImage": "https://i.wpimg.pl/1200x0/m.komorkomania.pl/iphone-13-pro-max-test-r-cb5979b.jpg",
        "publishedAt": "2021-10-08T17:37:21Z",
        "content": "Za wypoyczenie iPhone'a 13 Pro Max do testów dzikujemy sieci Orange.\r\niPhone 13 Pro Max od modelu 13 Pro róni si jedynie wielkoci ekranu i pojemnoci baterii. Z naszym testem moecie si wic zapozna naw… [+12939 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Gsmmaniak.pl"
        },
        "author": "Konrad Bartnik",
        "title": "Już dzisiaj zmieniłem swojego realme w Google Pixel 6. Ty też możesz i nie potrzebujesz do tego roota - gsmManiaK.pl",
        "description": "Już dzisiaj możesz zmienić wygląd swojego telefonu z Androidem na ten z Google Pixel 6. Przed premierą możesz pobrać piękne tapety, które odmienią Twojego smartfona.",
        "url": "https://www.gsmmaniak.pl/1261967/google-pixel-6-tapety-skad-pobrac/",
        "urlToImage": "https://www.gsmmaniak.pl/wp-content/uploads/gsmmaniak/2021/10/security.png",
        "publishedAt": "2021-10-08T17:30:12Z",
        "content": "Ju dzisiaj moesz zmieni wygld swojego telefonu z Androidem na ten z Google Pixel 6. Przed premier moesz pobra pikne tapety, które odmieni Twojego smartfona.\r\nAndroid na Google Pixel to klasa sama dla… [+1268 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Dobreprogramy.pl"
        },
        "author": "Karolina Kowasz",
        "title": "Procesory Intel Alder Lake znacznie szybsze. Wydajność zwiększy się o połowę - dobreprogramy",
        "description": "Im bliżej do premiery dwunastej generacji procesorów od Intela, tym więcej informacji na jego temat pojawia się w sieci…",
        "url": "https://www.dobreprogramy.pl/procesory-intel-alder-lake-znacznie-szybsze-wydajnosc-zwiekszy-sie-o-polowe,6691690692897408a",
        "urlToImage": "https://i.wpimg.pl/1600x900/filerepo.grupawp.pl/api/v1/display/embed/adcf2f6d-34c3-4b84-ba55-d1f54cad6bc3",
        "publishedAt": "2021-10-08T17:29:00Z",
        "content": "Im bliej do premiery dwunastej generacji procesorów od Intela, tym wicej informacji na jego temat pojawia si w sieci. Niektórzy publikuj nawet pierwsze benchmarki pokazujce moliwoci procesora, co tyl… [+1721 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Spidersweb.pl"
        },
        "author": null,
        "title": "Dostał dożywotniego bana na Facebooku, bo stworzył świetne narzędzie, które pozwala ludziom oderwać się od FB - Spider's Web",
        "description": "Stworzył narzędzie usuwające polubienia. W zamian programista otrzymał dożywotni ban na Facebooku.",
        "url": "https://spidersweb.pl/2021/10/unfollow-everything-ban-na-facebooku.html",
        "urlToImage": "https://ocs-pl.oktawave.com/v1/AUTH_2887234e-384a-4873-8bc5-405211db13a2/spidersweb/2021/10/ban-na-facebooku-nakaz-main.jpg",
        "publishedAt": "2021-10-08T17:17:45Z",
        "content": "Louis Barclay nie mia wyjcia, musia zastosowa si do da Facebooka, bo jak sam mówi wie, e nie ma szans w starciu z megakorporacj. Jednak zastraszajcy list Facebooka i reperkusje wobec autora rozszerze… [+665 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Antyweb.pl"
        },
        "author": null,
        "title": "GTA: The Trilogy - The Definitive Edition oficjalnie. Ale jest też zła wiadomość - Antyweb",
        "description": "Grand Theft Auto: The Trilogy - The Definitive Edition okazało się faktem. Dzisiaj Rockstar Games oficjalnie zapowiedziało kompilację, która jeszcze w tym roku trafi w ręce graczy.",
        "url": "https://antyweb.pl/gta-the-trilogy-the-definitive-edition-oficjalnie",
        "urlToImage": "https://antyweb.pl/img/1250/550/fit/wp-content/uploads/2021/10/ltox0tgzjo/852cd36dd27f7a71143a5fb17008e9d4aa9fc944.jpg",
        "publishedAt": "2021-10-08T17:06:12Z",
        "content": "O tym e trylogia GTA z ery PlayStation 2 nadchodzi ponownie - wiedzielimy ju od kilku dobrych tygodni. Z jednej strony: ogrzewany kotlet po raz kolejny, z drugiej strony - to przecie ulubieniec publi… [+1950 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Purepc.pl"
        },
        "author": null,
        "title": "ADATA XPG chwali się rekordowym OC modułów RAM typu DDR5. Tajwańczycy podkręcili pamięci do zawrotnych 8118 MHz - PurePC.pl",
        "description": "Grupa overclockerów działająca pod egidą ADATA XPG może pochwalić się kolejnym rekordowym OC. Tym razem na warsztat wzięte zostały nadciągające moduły RAM typu DDR5.",
        "url": "https://www.purepc.pl/adata-xpg-chwali-sie-rekordowym-oc-modulow-ram-typu-ddr5-tajwanczycy-podkrecili-pamieci-do-zawrotnych-8118-mhz",
        "urlToImage": "https://www.purepc.pl/image/news/2021/10/08_adata_xpg_chwali_sie_rekordowym_oc_modulow_ram_typu_ddr5_tajwanczycy_podkrecili_pamieci_do_zawrotnych_8118_mhz_2.jpg",
        "publishedAt": "2021-10-08T17:00:00Z",
        "content": "Premiera nowych procesorów Intel Alder Lake oraz dedykowanych im pyt gównych jest tu za rogiem. Nowa generacja CPU od Niebieskich moe porzdnie namiesza na rynku nie tylko ze wzgldu na (zgodnie z doty… [+1652 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Gsmmaniak.pl"
        },
        "author": "Konrad Bartnik",
        "title": "Fanie Xiaomi, będziesz zachwycony! Oto Amazfit GTR 3 i GTS 3 na oficjalnych grafikach przed premierą - gsmManiaK.pl",
        "description": "Amazfit GTR 3 i Amazfit GTS 3 przed premierą 11 października zdradzają design i kluczowe elementy specyfikacji na oficjalnych grafikach. Jeśli ceny będą atrakcyjne, to mamy 100% hity.",
        "url": "https://www.gsmmaniak.pl/1261961/amazfit-gtr-3-amazfit-gts-3-wyglad-rendery/",
        "urlToImage": "https://www.gsmmaniak.pl/wp-content/uploads/gsmmaniak/2021/10/Screenshot-2021-10-08-12.21.03.jpg",
        "publishedAt": "2021-10-08T16:45:50Z",
        "content": "Amazfit GTR 3 i Amazfit GTS 3 przed premier 11 padziernika zdradzaj design i kluczowe elementy specyfikacji na oficjalnych grafikach. Jeli ceny bd atrakcyjne, to mamy 100% hity.\r\nDo premiery nowych s… [+1983 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Wyborcza.pl"
        },
        "author": null,
        "title": "Autonomiczny robot mógł już zabić ludzi. To broń groźniejsza niż bomba atomowa - Gazeta Wyborcza",
        "description": null,
        "url": "https://wyborcza.pl/7,75400,27661280,autonomiczny-robot-mogl-juz-zabic-ludzi-to-bron-grozniejsza.html?disableRedirects=true",
        "urlToImage": null,
        "publishedAt": "2021-10-08T16:30:00Z",
        "content": null
      },
      {
        "source": {
          "id": null,
          "name": "Gsmmaniak.pl"
        },
        "author": "Dawid Bonkowski",
        "title": "Redmi K50 Pro+ ma być herkulesem wśród zabójców flagowców. Snap 898 to tylko przedsmak - gsmManiaK.pl",
        "description": "Redmi K50 Pro+ będzie niezwykłym smartfonem – już teraz możemy potwierdzić część jego specyfikacji, mimo że jego premiera ma nastąpić dopiero w 2022 roku. Na co możemy liczyć?",
        "url": "https://www.gsmmaniak.pl/1261941/redmi-k50-pro-plus-specyfikacja/",
        "urlToImage": "https://www.gsmmaniak.pl/wp-content/uploads/gsmmaniak/2021/03/Xiaomi-Redmi-K40.jpg",
        "publishedAt": "2021-10-08T16:00:01Z",
        "content": "Redmi K50 Pro+ bdzie niezwykym smartfonem ju teraz moemy potwierdzi cz jego specyfikacji, mimo e jego premiera ma nastpi dopiero w 2022 roku. Na co moemy liczy?\r\nNajlepsze smartfony Redmi przechodz t… [+1348 chars]"
      }
    ]
  }
]